---
kind: property
id: P:Autodesk.Revit.DB.Visual.Stone.StonePatternMap
source: html/c14d3d04-228c-f229-92d4-50a20e7c607b.htm
---
# Autodesk.Revit.DB.Visual.Stone.StonePatternMap Property

The property labeled "Image" from the "Stone" schema.

## Syntax (C#)
```csharp
public static string StonePatternMap { get; }
```

## Remarks
This property is of type "AssetPropertyReference" and will only contain a reference to a connected image.